# Estadistica aplicada
## Lizbeth Ramos Saucedo 1885423
### 3era sesion

In [4]:
import numpy as np 
import pandas as pd

In [37]:
alumno1 =['Juan', 'Perez', 23]
alumno2=['Raul', 'Lopez', 15]
alumno3 = ['Jhon', 'Lara', 18 ]
alumno4 =['Xime', 'Lira',22]
alumno5 =['Ale', 'Lugo',26]

In [38]:
estadistica = [alumno1, alumno2, alumno3, alumno4, alumno5]

In [39]:
estadistica=pd.DataFrame(estadistica,columns=['Nombre', 'apellido','edad'])

In [40]:
estadistica.columns

Index(['Nombre', 'apellido', 'edad'], dtype='object')

In [41]:
estadistica.index

RangeIndex(start=0, stop=5, step=1)

In [42]:
estadistica.shape

(5, 3)

In [43]:
estadistica.describe()

           edad
count   5.00000
mean   20.80000
std     4.32435
min    15.00000
25%    18.00000
50%    22.00000
75%    23.00000
max    26.00000

In [44]:
estadistica['Edad en dias'] = estadistica['edad']* 365

In [45]:
estadistica

  Nombre apellido  edad  Edad en dias
0   Juan    Perez    23          8395
1   Raul    Lopez    15          5475
2   Jhon     Lara    18          6570
3   Xime     Lira    22          8030
4    Ale     Lugo    26          9490

In [46]:
estadistica['origen']=['Apodaca', 'San Pedro', 'guadalupe', 'Salinas', 'Cadereyta']

In [47]:
estadistica

  Nombre apellido  edad  Edad en dias     origen
0   Juan    Perez    23          8395    Apodaca
1   Raul    Lopez    15          5475  San Pedro
2   Jhon     Lara    18          6570  guadalupe
3   Xime     Lira    22          8030    Salinas
4    Ale     Lugo    26          9490  Cadereyta

In [48]:
estadistica['edad'].mean()

20.8

In [49]:
round(estadistica['edad'].std(ddof=1),2)

4.32

In [50]:
estadistica.dtypes

Nombre          object
apellido        object
edad             int64
Edad en dias     int64
origen          object
dtype: object

In [51]:
estadistica.count()   #numero de datos que tenemos de cada variable

Nombre          5
apellido        5
edad            5
Edad en dias    5
origen          5
dtype: int64

In [52]:
estadistica.sort_values(['apellido', 'Nombre'], ascending= [True, True] )

  Nombre apellido  edad  Edad en dias     origen
2   Jhon     Lara    18          6570  guadalupe
3   Xime     Lira    22          8030    Salinas
1   Raul    Lopez    15          5475  San Pedro
4    Ale     Lugo    26          9490  Cadereyta
0   Juan    Perez    23          8395    Apodaca